GopalSaraf/Practicals/PSDL/include/proc/pic16lf1946.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define AN0                              BANKMASK(PORTA), 0
#define AN1                              BANKMASK(PORTA), 1
#define AN10                             BANKMASK(PORTF), 5
#define AN11                             BANKMASK(PORTF), 6
#define AN12                             BANKMASK(PORTG), 4
#define AN13                             BANKMASK(PORTG), 3
#define AN14                             BANKMASK(PORTG), 2
#define AN15                             BANKMASK(PORTG), 1
#define AN16                             BANKMASK(PORTF), 0
#define AN2                              BANKMASK(PORTA), 2
#define AN3                              BANKMASK(PORTA), 3
#define AN4                              BANKMASK(PORTA), 5
#define AN5                              BANKMASK(PORTF), 7
#define AN6                              BANKMASK(PORTF), 1
#define AN7                              BANKMASK(PORTF), 2
#define AN8                              BANKMASK(PORTF), 3
#define AN9                              BANKMASK(PORTF), 4
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSE0                            BANKMASK(ANSELE), 0
#define ANSE1                            BANKMASK(ANSELE), 1
#define ANSE2                            BANKMASK(ANSELE), 2
#define ANSF0                            BANKMASK(ANSELF), 0
#define ANSF1                            BANKMASK(ANSELF), 1
#define ANSF2                            BANKMASK(ANSELF), 2
#define ANSF3                            BANKMASK(ANSELF), 3
#define ANSF4                            BANKMASK(ANSELF), 4
#define ANSF5                            BANKMASK(ANSELF), 5
#define ANSF6                            BANKMASK(ANSELF), 6
#define ANSF7                            BANKMASK(ANSELF), 7
#define ANSG1                            BANKMASK(ANSELG), 1
#define ANSG2                            BANKMASK(ANSELG), 2
#define ANSG3                            BANKMASK(ANSELG), 3
#define ANSG4                            BANKMASK(ANSELG), 4
#define BCL2IE                           BANKMASK(PIE4), 1
#define BCL2IF                           BANKMASK(PIR4), 1
#define BCLIE                            BANKMASK(PIE2), 3
#define BCLIF                            BANKMASK(PIR2), 3
#define BIASMD                           BANKMASK(LCDPS), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1IN0N                           BANKMASK(PORTF), 0
#define C1IN1N                           BANKMASK(PORTF), 5
#define C1IN2N                           BANKMASK(PORTF), 3
#define C1IN3N                           BANKMASK(PORTF), 7
#define C1INP                            BANKMASK(PORTF), 6
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2IN0N                           BANKMASK(PORTF), 0
#define C2IN1N                           BANKMASK(PORTF), 5
#define C2IN2N                           BANKMASK(PORTF), 3
#define C2IN3N                           BANKMASK(PORTF), 7
#define C2INP                            BANKMASK(PORTF), 4
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2PCH0                           BANKMASK(CM2CON1), 4
#define C2PCH1                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3
#define C3HYS                            BANKMASK(CM3CON0), 1
#define C3IE                             BANKMASK(PIE2), 1
#define C3IF                             BANKMASK(PIR2), 1
#define C3IN0N                           BANKMASK(PORTG), 3
#define C3IN1N                           BANKMASK(PORTG), 4
#define C3IN2N                           BANKMASK(PORTF), 3
#define C3IN3N                           BANKMASK(PORTF), 7
#define C3INP                            BANKMASK(PORTG), 2
#define C3INTN                           BANKMASK(CM3CON1), 6
#define C3INTP                           BANKMASK(CM3CON1), 7
#define C3NCH0                           BANKMASK(CM3CON1), 0
#define C3NCH1                           BANKMASK(CM3CON1), 1
#define C3OE                             BANKMASK(CM3CON0), 5
#define C3ON                             BANKMASK(CM3CON0), 7
#define C3PCH0                           BANKMASK(CM3CON1), 4
#define C3PCH1                           BANKMASK(CM3CON1), 5
#define C3POL                            BANKMASK(CM3CON0), 4
#define C3SP                             BANKMASK(CM3CON0), 2
#define C3SYNC                           BANKMASK(CM3CON0), 0
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7
#define C5TSEL0                          BANKMASK(CCPTMRS1), 0
#define C5TSEL1                          BANKMASK(CCPTMRS1), 1
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1                             BANKMASK(PORTC), 2
#define CCP1AS0                          BANKMASK(CCP1AS), 4
#define CCP1AS1                          BANKMASK(CCP1AS), 5
#define CCP1AS2                          BANKMASK(CCP1AS), 6
#define CCP1ASE                          BANKMASK(CCP1AS), 7
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP2AS0                          BANKMASK(CCP2AS), 4
#define CCP2AS1                          BANKMASK(CCP2AS), 5
#define CCP2AS2                          BANKMASK(CCP2AS), 6
#define CCP2ASE                          BANKMASK(CCP2AS), 7
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2M0                           BANKMASK(CCP2CON), 0
#define CCP2M1                           BANKMASK(CCP2CON), 1
#define CCP2M2                           BANKMASK(CCP2CON), 2
#define CCP2M3                           BANKMASK(CCP2CON), 3
#define CCP2SEL                          BANKMASK(APFCON), 2
#define CCP3                             BANKMASK(PORTG), 0
#define CCP3AS0                          BANKMASK(CCP3AS), 4
#define CCP3AS1                          BANKMASK(CCP3AS), 5
#define CCP3AS2                          BANKMASK(CCP3AS), 6
#define CCP3ASE                          BANKMASK(CCP3AS), 7
#define CCP3IE                           BANKMASK(PIE3), 4
#define CCP3IF                           BANKMASK(PIR3), 4
#define CCP3M0                           BANKMASK(CCP3CON), 0
#define CCP3M1                           BANKMASK(CCP3CON), 1
#define CCP3M2                           BANKMASK(CCP3CON), 2
#define CCP3M3                           BANKMASK(CCP3CON), 3
#define CCP4                             BANKMASK(PORTG), 3
#define CCP4IE                           BANKMASK(PIE3), 5
#define CCP4IF                           BANKMASK(PIR3), 5
#define CCP4M0                           BANKMASK(CCP4CON), 0
#define CCP4M1                           BANKMASK(CCP4CON), 1
#define CCP4M2                           BANKMASK(CCP4CON), 2
#define CCP4M3                           BANKMASK(CCP4CON), 3
#define CCP5                             BANKMASK(PORTG), 4
#define CCP5IE                           BANKMASK(PIE3), 6
#define CCP5IF                           BANKMASK(PIR3), 6
#define CCP5M0                           BANKMASK(CCP5CON), 0
#define CCP5M1                           BANKMASK(CCP5CON), 1
#define CCP5M2                           BANKMASK(CCP5CON), 2
#define CCP5M3                           BANKMASK(CCP5CON), 3
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(EECON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CK1                              BANKMASK(PORTC), 6
#define CK2                              BANKMASK(PORTG), 1
#define CLKIN                            BANKMASK(PORTA), 7
#define CLKOUT                           BANKMASK(PORTA), 6
#define COM0                             BANKMASK(PORTE), 3
#define COM1                             BANKMASK(PORTE), 4
#define COM2                             BANKMASK(PORTE), 5
#define COM3                             BANKMASK(PORTE), 6
#define CPS0                             BANKMASK(PORTA), 0
#define CPS1                             BANKMASK(PORTA), 1
#define CPS10                            BANKMASK(PORTF), 5
#define CPS11                            BANKMASK(PORTF), 6
#define CPS12                            BANKMASK(PORTG), 4
#define CPS13                            BANKMASK(PORTG), 3
#define CPS14                            BANKMASK(PORTG), 2
#define CPS15                            BANKMASK(PORTG), 1
#define CPS16                            BANKMASK(PORTF), 0
#define CPS2                             BANKMASK(PORTA), 2
#define CPS3                             BANKMASK(PORTA), 3
#define CPS4                             BANKMASK(PORTA), 5
#define CPS5                             BANKMASK(PORTF), 7
#define CPS6                             BANKMASK(PORTF), 1
#define CPS7                             BANKMASK(PORTF), 2
#define CPS8                             BANKMASK(PORTF), 3
#define CPS9                             BANKMASK(PORTF), 4
#define CPSCH0                           BANKMASK(CPSCON1), 0
#define CPSCH1                           BANKMASK(CPSCON1), 1
#define CPSCH2                           BANKMASK(CPSCON1), 2
#define CPSCH3                           BANKMASK(CPSCON1), 3
#define CPSCH4                           BANKMASK(CPSCON1), 4
#define CPSON                            BANKMASK(CPSCON0), 7
#define CPSOUT                           BANKMASK(CPSCON0), 1
#define CPSRM                            BANKMASK(CPSCON0), 6
#define CPSRNG0                          BANKMASK(CPSCON0), 2
#define CPSRNG1                          BANKMASK(CPSCON0), 3
#define CS0                              BANKMASK(LCDCON), 2
#define CS1                              BANKMASK(LCDCON), 3
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DACEN                            BANKMASK(DACCON0), 7
#define DACLPS                           BANKMASK(DACCON0), 6
#define DACNSS                           BANKMASK(DACCON0), 0
#define DACOE                            BANKMASK(DACCON0), 5
#define DACOUT                           BANKMASK(PORTF), 5
#define DACPSS0                          BANKMASK(DACCON0), 2
#define DACPSS1                          BANKMASK(DACCON0), 3
#define DACR0                            BANKMASK(DACCON1), 0
#define DACR1                            BANKMASK(DACCON1), 1
#define DACR2                            BANKMASK(DACCON1), 2
#define DACR3                            BANKMASK(DACCON1), 3
#define DACR4                            BANKMASK(DACCON1), 4
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define DC2B0                            BANKMASK(CCP2CON), 4
#define DC2B1                            BANKMASK(CCP2CON), 5
#define DC3B0                            BANKMASK(CCP3CON), 4
#define DC3B1                            BANKMASK(CCP3CON), 5
#define DC4B0                            BANKMASK(CCP4CON), 4
#define DC4B1                            BANKMASK(CCP4CON), 5
#define DC5B0                            BANKMASK(CCP5CON), 4
#define DC5B1                            BANKMASK(CCP5CON), 5
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DT1                              BANKMASK(PORTC), 7
#define DT2                              BANKMASK(PORTG), 2
#define EEIE                             BANKMASK(PIE2), 4
#define EEIF                             BANKMASK(PIR2), 4
#define EEPGD                            BANKMASK(EECON1), 7
#define FLT0                             BANKMASK(PORTB), 0
#define FREE                             BANKMASK(EECON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCBF0                           BANKMASK(IOCBF), 0
#define IOCBF1                           BANKMASK(IOCBF), 1
#define IOCBF2                           BANKMASK(IOCBF), 2
#define IOCBF3                           BANKMASK(IOCBF), 3
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN0                           BANKMASK(IOCBN), 0
#define IOCBN1                           BANKMASK(IOCBN), 1
#define IOCBN2                           BANKMASK(IOCBN), 2
#define IOCBN3                           BANKMASK(IOCBN), 3
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP0                           BANKMASK(IOCBP), 0
#define IOCBP1                           BANKMASK(IOCBP), 1
#define IOCBP2                           BANKMASK(IOCBP), 2
#define IOCBP3                           BANKMASK(IOCBP), 3
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATA6                            BANKMASK(LATA), 6
#define LATA7                            BANKMASK(LATA), 7
#define LATB0                            BANKMASK(LATB), 0
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LATD0                            BANKMASK(LATD), 0
#define LATD1                            BANKMASK(LATD), 1
#define LATD2                            BANKMASK(LATD), 2
#define LATD3                            BANKMASK(LATD), 3
#define LATD4                            BANKMASK(LATD), 4
#define LATD5                            BANKMASK(LATD), 5
#define LATD6                            BANKMASK(LATD), 6
#define LATD7                            BANKMASK(LATD), 7
#define LATE0                            BANKMASK(LATE), 0
#define LATE1                            BANKMASK(LATE), 1
#define LATE2                            BANKMASK(LATE), 2
#define LATE3                            BANKMASK(LATE), 3
#define LATE4                            BANKMASK(LATE), 4
#define LATE5                            BANKMASK(LATE), 5
#define LATE6                            BANKMASK(LATE), 6
#define LATE7                            BANKMASK(LATE), 7
#define LATF0                            BANKMASK(LATF), 0
#define LATF1                            BANKMASK(LATF), 1
#define LATF2                            BANKMASK(LATF), 2
#define LATF3                            BANKMASK(LATF), 3
#define LATF4                            BANKMASK(LATF), 4
#define LATF5                            BANKMASK(LATF), 5
#define LATF6                            BANKMASK(LATF), 6
#define LATF7                            BANKMASK(LATF), 7
#define LATG0                            BANKMASK(LATG), 0
#define LATG1                            BANKMASK(LATG), 1
#define LATG2                            BANKMASK(LATG), 2
#define LATG3                            BANKMASK(LATG), 3
#define LATG4                            BANKMASK(LATG), 4
#define LATG5                            BANKMASK(LATG), 5
#define LCDA                             BANKMASK(LCDPS), 5
#define LCDCST0                          BANKMASK(LCDCST), 0
#define LCDCST1                          BANKMASK(LCDCST), 1
#define LCDCST2                          BANKMASK(LCDCST), 2
#define LCDEN                            BANKMASK(LCDCON), 7
#define LCDIE                            BANKMASK(PIE2), 2
#define LCDIF                            BANKMASK(PIR2), 2
#define LCDIRE                           BANKMASK(LCDREF), 7
#define LCDIRI                           BANKMASK(LCDREF), 5
#define LCDIRS                           BANKMASK(LCDREF), 6
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LMUX0                            BANKMASK(LCDCON), 0
#define LMUX1                            BANKMASK(LCDCON), 1
#define LP0                              BANKMASK(LCDPS), 0
#define LP1                              BANKMASK(LCDPS), 1
#define LP2                              BANKMASK(LCDPS), 2
#define LP3                              BANKMASK(LCDPS), 3
#define LRLAP0                           BANKMASK(LCDRL), 6
#define LRLAP1                           BANKMASK(LCDRL), 7
#define LRLAT0                           BANKMASK(LCDRL), 0
#define LRLAT1                           BANKMASK(LCDRL), 1
#define LRLAT2                           BANKMASK(LCDRL), 2
#define LRLBP0                           BANKMASK(LCDRL), 4
#define LRLBP1                           BANKMASK(LCDRL), 5
#define LWLO                             BANKMASK(EECON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MC3OUT                           BANKMASK(CMOUT), 2
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define OSC1                             BANKMASK(PORTA), 7
#define OSC2                             BANKMASK(PORTA), 6
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
